maxgerhardt/micropython/ports/ch32/machine_i2s.c
/* machine.I2S on the I2S2/I2S3 peripherals.
 *
 * Most of the class is shared code in extmod/machine_i2s.c; this file supplies
 * the hardware half, named by MICROPY_PY_MACHINE_I2S_INCLUDEFILE.
 *
 *     from machine import I2S, Pin
 *     i2s = I2S(0, sck=Pin("PB13"), ws=Pin("PB12"), sd=Pin("PB15"),
 *               mode=I2S.TX, bits=16, format=I2S.STEREO, rate=44100, ibuf=16384)
 *     i2s.write(pcm)
 *
 * I2S(0) is I2S2 (on SPI2) and I2S(1) is I2S3 (on SPI3). They are independent:
 * unlike the SAI blocks this replaced, neither is synchronous to the other and
 * either can be used alone.
 *
 * ### Why not the SAI
 *
 * This port drove machine.I2S from the SAI until now, because every I2S2/I2S3
 * pin sits in the VIO18 domain and that measured 1.2 V -- unusable against a
 * 3.3 V audio device. VIO18 turned out to be a software-set rail (see
 * machine_vio18.c); at 3.3 V these pins are ordinary 3.3 V pins and the
 * original objection is void.
 *
 * Two things are better here. The rate divider is I2SDIV[7:0] plus an ODD
 * half-step, against the SAI's 6-bit MCKDIV, so 44.1 kHz lands within 0.16%
 * (about 3 cents) instead of over 1% (about 21 cents). And the clock source is
 * selected per peripheral rather than shared with SYSCLK's own tree.
 *
 * The SAI driver is kept verbatim at docs/hw/sai-i2s-driver-reference.c.txt,
 * including its hard-won notes on frame-sync polarity and DMA ordering, for
 * whenever SAI is worth re-adding as its own class.
 */

/* stdlib.h and string.h are needed by extmod/machine_i2s.c, which #includes
 * this file rather than the other way round -- dropping them breaks abs() and
 * memset() in code that is not even in this file. irq.h supplies
 * CH32_IRQ_HANDLER, without which the handler declarations below parse as
 * K&R-style definitions and fail on a strict compiler. */
#include <stdlib.h>
#include <string.h>

#include "py/mphal.h"
#include "py/runtime.h"

#include "ch32h417.h"
#include "irq.h"
#include "machine_pin.h"

/* Two peripherals: I2S2 and I2S3. */
#define MAX_I2S_CH32 (2)

/* 512 bytes, halved into the two ping-pong regions the DMA alternates between.
 * At 44.1 kHz stereo 16-bit that is 2.9 ms per full buffer, so about 690
 * interrupts a second -- small enough to hide a garbage collection behind and
 * large enough not to spend the core in interrupt entry. */
#define SIZEOF_DMA_BUFFER_IN_BYTES (512)
#define SIZEOF_HALF_DMA_BUFFER_IN_BYTES (SIZEOF_DMA_BUFFER_IN_BYTES / 2)

/* DMA1 channels 2 and 3 belong to machine.SPI and 1 to machine.AudioOut; 4 and
 * 5 are ours. One channel per peripheral is enough: an I2S object is either RX
 * or TX, never both. */
#define I2S_DMA_A_FLAGS ((uint32_t)0x0000F000)   /* channel 4 nibble */
#define I2S_DMA_A_HT ((uint32_t)0x00004000)
#define I2S_DMA_B_FLAGS ((uint32_t)0x000F0000)   /* channel 5 nibble */
#define I2S_DMA_B_HT ((uint32_t)0x00040000)

/* DMAMUX request numbers, reference manual table 10-2. */
#define I2S_DMA_REQ_2_TX (65)
#define I2S_DMA_REQ_2_RX (66)
#define I2S_DMA_REQ_3_TX (67)
#define I2S_DMA_REQ_3_RX (68)

/* I2SDIV is 8 bits and must be at least 2; ODD adds the half step, so the
 * effective divisor 2*I2SDIV+ODD runs from 4 to 511. */
#define I2S_DIV_MIN (2)
#define I2S_DIV_MAX (255)

/* In non-blocking mode the ring buffer is drained/filled faster than the DMA
 * moves data, so a slow caller cannot make it underflow. */
#define NON_BLOCKING_RATE_MULTIPLIER (4)
#define SIZEOF_NON_BLOCKING_COPY_IN_BYTES (SIZEOF_HALF_DMA_BUFFER_IN_BYTES * NON_BLOCKING_RATE_MULTIPLIER)

/* Receive always captures 32-bit stereo, whatever the user asked for, and
 * extmod/machine_i2s.c reshapes it on the way out through this map. So the
 * ring buffer always holds 8-byte frames on the RX side, and -1 means "this
 * output byte comes from nowhere".
 *
 * The half-words of a 32-bit sample arrive in the opposite order to the one
 * they need in memory, which is what makes this table differ from the version
 * in ports/stm32. The data register is 16 bits wide, so one sample is two
 * transfers, and the bus carries the slot most significant half first -- the
 * DMA therefore lands slot[31:16] in src[0..1] and slot[15:0] in src[2..3],
 * while a little-endian 32-bit sample wants exactly the reverse. The SAI this
 * port used previously had a 32-bit register and moved a whole sample per
 * transfer, so the question never arose there.
 *
 * Measured rather than reasoned: an INMP441 (24 bits left-justified in a
 * 32-bit slot, so the low byte should barely move) gave 93 distinct low bytes
 * as captured and 2 with the halves exchanged, with 1024/1024 samples fitting
 * in 24 bits instead of 1022. The 16-bit rows follow from the same ordering --
 * the most significant half of the slot is src[0..1], not src[2..3]. */
static const int8_t i2s_frame_map[NUM_I2S_USER_FORMATS][I2S_RX_FRAME_SIZE_IN_BYTES] = {
    {  0,  1, -1, -1, -1, -1, -1, -1 },  // Mono, 16-bit
    {  2,  3,  0,  1, -1, -1, -1, -1 },  // Mono, 32-bit
    {  0,  1, -1, -1,  2,  3, -1, -1 },  // Stereo, 16-bit
    {  2,  3,  0,  1,  6,  7,  4,  5 },  // Stereo, 32-bit
};

static int8_t get_frame_mapping_index(int8_t bits, format_t format) {
    if (format == MONO) {
        return bits == 16 ? 0 : 1;
    }
    return bits == 16 ? 2 : 3;
}

/* Owned by the port rather than extmod, and named by mpconfigport.h through
 * MICROPY_PY_MACHINE_I2S_CONSTANT_RX/TX to reach the Python-visible I2S.RX and
 * I2S.TX. */
typedef enum {
    RX,
    TX
} i2s_mode_t;

typedef struct _i2s_pin_t {
    mp_hal_pin_obj_t pin;
    uint8_t af;
} i2s_pin_t;

typedef struct _machine_i2s_obj_t {
    mp_obj_base_t base;
    uint8_t i2s_id;
    mp_hal_pin_obj_t sck;
    mp_hal_pin_obj_t ws;
    mp_hal_pin_obj_t sd;
    i2s_mode_t mode;
    int8_t bits;
    format_t format;
    int32_t rate;
    int32_t ibuf;
    mp_obj_t callback_for_non_blocking;
    io_mode_t io_mode;
    SPI_TypeDef *spi;
    DMA_Channel_TypeDef *dma;
    uint32_t dma_flags;
    uint32_t dma_ht_flag;
    IRQn_Type dma_irqn;
    int32_t actual_rate;              // what the divider could really produce
    uint8_t dma_buffer[SIZEOF_DMA_BUFFER_IN_BYTES];
    ring_buf_t ring_buffer;
    uint8_t *ring_buffer_storage;
    non_blocking_descriptor_t non_blocking_descriptor;
} machine_i2s_obj_t;

static machine_i2s_obj_t *machine_i2s_active[MAX_I2S_CH32];

/* Pin options, from datasheet tables 2-2-8. Every one of these is a 3.3 V pin
 * now that VIO18 is set to 3.3 V at boot; before that none of them were, which
 * is why this port used the SAI instead. */
static const i2s_pin_t i2s_ws_pins_2[] = {
    { &pin_B12_obj, GPIO_AF5 }, { &pin_B9_obj, GPIO_AF5 },
    { &pin_A11_obj, GPIO_AF5 }, { &pin_B4_obj, GPIO_AF7 },
};
static const i2s_pin_t i2s_sck_pins_2[] = {
    { &pin_B13_obj, GPIO_AF5 }, { &pin_B10_obj, GPIO_AF5 },
    { &pin_A9_obj, GPIO_AF5 }, { &pin_A12_obj, GPIO_AF5 },
    { &pin_D3_obj, GPIO_AF5 },
};
