maxgerhardt/micropython/ports/ch32/machine_i2s.c
static const i2s_pin_t i2s_sd_pins_2[] = {
    { &pin_B15_obj, GPIO_AF5 }, { &pin_C1_obj, GPIO_AF5 },
    { &pin_C3_obj, GPIO_AF5 },
};

static const i2s_pin_t i2s_ws_pins_3[] = {
    { &pin_A4_obj, GPIO_AF6 }, { &pin_A15_obj, GPIO_AF6 },
};
static const i2s_pin_t i2s_sck_pins_3[] = {
    { &pin_B3_obj, GPIO_AF6 }, { &pin_C10_obj, GPIO_AF6 },
    { &pin_A14_obj, GPIO_AF1 },
};
static const i2s_pin_t i2s_sd_pins_3[] = {
    { &pin_B2_obj, GPIO_AF7 }, { &pin_B5_obj, GPIO_AF7 },
    { &pin_C12_obj, GPIO_AF6 }, { &pin_D6_obj, GPIO_AF5 },
    { &pin_A13_obj, GPIO_AF1 },
};

#define I2S_PIN_COUNT(t) (sizeof(t) / sizeof((t)[0]))

static uint8_t i2s_find_af(const i2s_pin_t *table, size_t len, mp_hal_pin_obj_t pin) {
    for (size_t i = 0; i < len; i++) {
        if (table[i].pin == pin) {
            return table[i].af;
        }
    }
    mp_raise_ValueError(MP_ERROR_TEXT("pin cannot be used for this I2S signal"));
    return 0;
}

/******************************************************************************/
// Clocking

/* Sample rate is I2SxCLK / (base * (2 * I2SDIV + ODD)) with the master clock
 * output disabled, where base is 32 for a 16-bit channel and 64 for a 32-bit
 * one. I2SDIV is a whole byte and ODD contributes a half step, so the divisor
 * moves in steps of one part in a few hundred -- fine enough that 44.1 kHz
 * lands about 3 cents sharp rather than the SAI's 21.
 *
 * The object reports what it actually got rather than echoing the request --
 * print(i2s) shows both, and ch32.i2s_actual_rate() returns it -- because
 * silently running a fraction of a percent fast is exactly the sort of thing
 * that turns into a pitch-shifted recording nobody can account for. */
static uint8_t i2s_channel_bits(machine_i2s_obj_t *self) {
    /* Receive always runs 32-bit channels because extmod's frame map expects
     * 8-byte frames and narrows them itself; transmit uses what was asked. */
    return self->mode == RX ? 32 : (uint8_t)self->bits;
}

static uint32_t i2s_set_rate(machine_i2s_obj_t *self) {
    RCC_ClocksTypeDef clocks;
    RCC_GetClocksFreq(&clocks);
    uint32_t clk = clocks.SYSCLK_Frequency;
    uint32_t base = (i2s_channel_bits(self) == 16) ? 32u : 64u;

    /* Nearest whole divisor, then split into the byte and the half step. */
    uint32_t n = (clk + (base * (uint32_t)self->rate) / 2u) / (base * (uint32_t)self->rate);
    if (n < I2S_DIV_MIN * 2u) {
        n = I2S_DIV_MIN * 2u;
    }
    if (n > I2S_DIV_MAX * 2u + 1u) {
        mp_raise_ValueError(MP_ERROR_TEXT("rate too low for this clock"));
    }

    self->actual_rate = (int32_t)(clk / (base * n));
    return n;
}

/******************************************************************************/
// DMA

/* Receive: raw bytes straight into the ring buffer. No format conversion here
 * -- the hardware is always 32-bit stereo on this path and i2s_frame_map does
 * the reshaping later. Dropping the whole half when it will not fit is
 * deliberate: a partial frame would desynchronise left from right for every
 * sample after it. */
static void i2s_empty_dma(machine_i2s_obj_t *self, uint8_t *half) {
    if (ringbuf_available_space(&self->ring_buffer) >= SIZEOF_HALF_DMA_BUFFER_IN_BYTES) {
        for (uint32_t i = 0; i < SIZEOF_HALF_DMA_BUFFER_IN_BYTES; i++) {
            ringbuf_push(&self->ring_buffer, half[i]);
        }
    }
}

/* Transmit: the bus always carries two slots, so a mono stream is written into
 * both of them -- otherwise it would come out of one channel only, at half the
 * expected rate. */
static void i2s_feed_dma(machine_i2s_obj_t *self, uint8_t *half) {
    if (ringbuf_available_data(&self->ring_buffer) < SIZEOF_HALF_DMA_BUFFER_IN_BYTES) {
        // Underflow: send silence rather than repeating whatever was here.
        memset(half, 0, SIZEOF_HALF_DMA_BUFFER_IN_BYTES);
        return;
    }

    if (self->format == MONO) {
        uint32_t sample = (uint32_t)self->bits / 8u;
        uint32_t frame = sample * 2u;
        for (uint32_t i = 0; i < SIZEOF_HALF_DMA_BUFFER_IN_BYTES / frame; i++) {
            for (uint32_t b = 0; b < sample; b++) {
                ringbuf_pop(&self->ring_buffer, &half[i * frame + b]);
                half[i * frame + sample + b] = half[i * frame + b];
            }
        }
    } else {
        for (uint32_t i = 0; i < SIZEOF_HALF_DMA_BUFFER_IN_BYTES; i++) {
            ringbuf_pop(&self->ring_buffer, &half[i]);
        }
    }

    /* Mirror of the ordering described at i2s_frame_map: the bus carries the
     * most significant half of a slot first, so a 32-bit sample has to be
     * handed to the 16-bit data register high half first, which is the
     * opposite of how it sits in memory. Sending it as-is transmits the two
     * halves swapped. 16-bit samples are a single transfer and need nothing.
     *
     * The transmit direction has no microphone to measure against; this
     * follows from the half-word order measured on receive, which shares the
     * data register and the same shift chain. */
    if (self->bits == 32) {
        uint16_t *w = (uint16_t *)(void *)half;
        for (uint32_t i = 0; i < SIZEOF_HALF_DMA_BUFFER_IN_BYTES / 4; i++) {
            uint16_t t = w[i * 2];
            w[i * 2] = w[i * 2 + 1];
            w[i * 2 + 1] = t;
        }
    }
}

static void i2s_dma_irq_handler(uint8_t id) {
    machine_i2s_obj_t *self = machine_i2s_active[id];
    if (self == NULL) {
        return;
    }

    uint32_t flags = DMA1->INTFR & self->dma_flags;
    DMA1->INTFCR = self->dma_flags;

    /* Half-transfer means the DMA has finished the first half and moved to the
     * second, so the first half is ours; transfer-complete is the mirror of
     * that. Servicing the wrong half would race the DMA. */
    uint8_t *half = (flags & self->dma_ht_flag)
        ? &self->dma_buffer[0]
        : &self->dma_buffer[SIZEOF_HALF_DMA_BUFFER_IN_BYTES];

    if (self->mode == TX) {
        if (self->io_mode == NON_BLOCKING && self->non_blocking_descriptor.copy_in_progress) {
            copy_appbuf_to_ringbuf_non_blocking(self);
        }
        i2s_feed_dma(self, half);
    } else {
        i2s_empty_dma(self, half);
        if (self->io_mode == NON_BLOCKING && self->non_blocking_descriptor.copy_in_progress) {
            fill_appbuf_from_ringbuf_non_blocking(self);
        }
    }
}

void CH32_IRQ_HANDLER(DMA1_Channel4_IRQHandler);
void DMA1_Channel4_IRQHandler(void) {
    i2s_dma_irq_handler(0);
}

