maxgerhardt/micropython/ports/ch32/machine_i2s.c
void CH32_IRQ_HANDLER(DMA1_Channel5_IRQHandler);
void DMA1_Channel5_IRQHandler(void) {
    i2s_dma_irq_handler(1);
}

static void i2s_dma_init(machine_i2s_obj_t *self) {
    RCC_HBPeriphClockCmd(RCC_HBPeriph_DMA1, ENABLE);
    (void)RCC->HBPCENR;

    DMA_Cmd(self->dma, DISABLE);
    DMA1->INTFCR = self->dma_flags;

    DMA_InitTypeDef init = { 0 };
    init.DMA_PeripheralBaseAddr = (uint32_t)&self->spi->DATAR;
    init.DMA_Memory0BaseAddr = (uint32_t)self->dma_buffer;
    init.DMA_DIR = (self->mode == RX) ? DMA_DIR_PeripheralSRC : DMA_DIR_PeripheralDST;
    /* The I2S data register is 16 bits wide -- a 32-bit sample is two accesses
     * -- so the DMA moves half-words and the buffer length is in transfers,
     * not bytes. This is the one place the SAI differed: its register was 32
     * bits and it moved words. */
    init.DMA_BufferSize = SIZEOF_DMA_BUFFER_IN_BYTES / 2;
    init.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    init.DMA_MemoryInc = DMA_MemoryInc_Enable;
    init.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    init.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
    init.DMA_Mode = DMA_Mode_Circular;
    init.DMA_Priority = DMA_Priority_VeryHigh;
    init.DMA_M2M = DMA_M2M_Disable;
    DMA_Init(self->dma, &init);

    uint8_t req;
    if (self->i2s_id == 0) {
        req = (self->mode == RX) ? I2S_DMA_REQ_2_RX : I2S_DMA_REQ_2_TX;
        DMA_MuxChannelConfig(DMA_MuxChannel4, req);
    } else {
        req = (self->mode == RX) ? I2S_DMA_REQ_3_RX : I2S_DMA_REQ_3_TX;
        DMA_MuxChannelConfig(DMA_MuxChannel5, req);
    }

    DMA_ITConfig(self->dma, DMA_IT_TC | DMA_IT_HT, ENABLE);
    NVIC_SetPriority(self->dma_irqn, 2);
    NVIC_EnableIRQ(self->dma_irqn);
    DMA_Cmd(self->dma, ENABLE);
}

/******************************************************************************/
// I2S peripheral

static void i2s_periph_init(machine_i2s_obj_t *self) {
    RCC_HB1PeriphClockCmd(
        self->i2s_id == 0 ? RCC_HB1Periph_SPI2 : RCC_HB1Periph_SPI3, ENABLE);
    (void)RCC->HB1PCENR;

    I2S_Cmd(self->spi, DISABLE);

    uint8_t chbits = i2s_channel_bits(self);
    I2S_InitTypeDef init = { 0 };
    init.I2S_Mode = (self->mode == RX) ? I2S_Mode_MasterRx : I2S_Mode_MasterTx;
    init.I2S_Standard = I2S_Standard_Phillips;
    init.I2S_DataFormat = (chbits == 16) ? I2S_DataFormat_16b : I2S_DataFormat_32b;
    init.I2S_MCLKOutput = I2S_MCLKOutput_Disable;
    init.I2S_AudioFreq = (uint32_t)self->rate;
    init.I2S_CPOL = I2S_CPOL_Low;
    I2S_Init(self->spi, &init);

    /* I2S_Init() derives the prescaler itself, rounding through a decimal
     * intermediate. Overwrite it with the nearest divisor so the delivered
     * rate is the best the hardware can do and actual_rate describes it
     * exactly. */
    uint32_t n = i2s_set_rate(self);
    self->spi->I2SPR = (uint16_t)((n >> 1) | ((n & 1u) ? SPI_I2SPR_ODD : 0u));

    SPI_I2S_DMACmd(self->spi,
        (self->mode == RX) ? SPI_I2S_DMAReq_Rx : SPI_I2S_DMAReq_Tx, ENABLE);
}

static void i2s_pin_init(mp_hal_pin_obj_t pin, uint8_t af, bool input) {
    machine_pin_clock_enable(pin->id);
    RCC_HB2PeriphClockCmd(RCC_HB2Periph_AFIO, ENABLE);

    GPIO_InitTypeDef init = { 0 };
    init.GPIO_Pin = MACHINE_PIN_MASK(pin->id);
    /* Reference manual table 9-6 allows a pull on a receiving SD pin. On this
     * silicon that is wrong -- the same trap the SAI driver hit: with a pull
     * configured the pad still follows the signal but the peripheral samples
     * nothing, because only the floating-input mode routes the pad inward. */
    init.GPIO_Mode = input ? GPIO_Mode_IN_FLOATING : GPIO_Mode_AF_PP;
    init.GPIO_Speed = GPIO_Speed_Very_High;
    GPIO_Init(machine_pin_gpio(pin->id), &init);
    if (!input) {
        GPIO_PinAFConfig(machine_pin_gpio(pin->id), MACHINE_PIN_NUM(pin->id), af);
    } else {
        GPIO_PinAFConfig(machine_pin_gpio(pin->id), MACHINE_PIN_NUM(pin->id), af);
    }
}

/******************************************************************************/
// extmod interface

static void mp_machine_i2s_init_helper(machine_i2s_obj_t *self, mp_arg_val_t *args) {
    mp_hal_pin_obj_t sck = args[ARG_sck].u_obj == MP_OBJ_NULL
        ? NULL : mp_hal_get_pin_obj(args[ARG_sck].u_obj);
    mp_hal_pin_obj_t ws = args[ARG_ws].u_obj == MP_OBJ_NULL
        ? NULL : mp_hal_get_pin_obj(args[ARG_ws].u_obj);
    mp_hal_pin_obj_t sd = args[ARG_sd].u_obj == MP_OBJ_NULL
        ? NULL : mp_hal_get_pin_obj(args[ARG_sd].u_obj);
    if (sck == NULL || ws == NULL || sd == NULL) {
        mp_raise_ValueError(MP_ERROR_TEXT("sck, ws and sd are all required"));
    }

    i2s_mode_t mode;
    if (args[ARG_mode].u_int == (mp_int_t)RX) {
        mode = RX;
    } else if (args[ARG_mode].u_int == (mp_int_t)TX) {
        mode = TX;
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid mode"));
    }

    int8_t bits = args[ARG_bits].u_int;
    if (bits != 16 && bits != 32) {
        mp_raise_ValueError(MP_ERROR_TEXT("bits must be 16 or 32"));
    }

    format_t format;
    if (args[ARG_format].u_int == (mp_int_t)MONO) {
        format = MONO;
    } else if (args[ARG_format].u_int == (mp_int_t)STEREO) {
        format = STEREO;
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid format"));
    }

    int32_t rate = args[ARG_rate].u_int;
    if (rate <= 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid rate"));
    }

    int32_t ring_buffer_len = args[ARG_ibuf].u_int;
    if (ring_buffer_len <= 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid ibuf"));
    }

    /* Everything is validated, and the pins resolved, before anything is
     * committed -- a bad argument leaves a working object untouched rather
     * than half reconfigured. */
    const i2s_pin_t *sck_tab = self->i2s_id == 0 ? i2s_sck_pins_2 : i2s_sck_pins_3;
    const i2s_pin_t *ws_tab = self->i2s_id == 0 ? i2s_ws_pins_2 : i2s_ws_pins_3;
    const i2s_pin_t *sd_tab = self->i2s_id == 0 ? i2s_sd_pins_2 : i2s_sd_pins_3;
    size_t sck_len = self->i2s_id == 0 ? I2S_PIN_COUNT(i2s_sck_pins_2) : I2S_PIN_COUNT(i2s_sck_pins_3);
    size_t ws_len = self->i2s_id == 0 ? I2S_PIN_COUNT(i2s_ws_pins_2) : I2S_PIN_COUNT(i2s_ws_pins_3);
    size_t sd_len = self->i2s_id == 0 ? I2S_PIN_COUNT(i2s_sd_pins_2) : I2S_PIN_COUNT(i2s_sd_pins_3);
    uint8_t sck_af = i2s_find_af(sck_tab, sck_len, sck);
    uint8_t ws_af = i2s_find_af(ws_tab, ws_len, ws);
    uint8_t sd_af = i2s_find_af(sd_tab, sd_len, sd);

    self->ring_buffer_storage = m_new(uint8_t, ring_buffer_len);
    ringbuf_init(&self->ring_buffer, self->ring_buffer_storage, ring_buffer_len);

    self->sck = sck;
    self->ws = ws;
    self->sd = sd;
    self->mode = mode;
    self->bits = bits;
    self->format = format;
    self->rate = rate;
    self->ibuf = ring_buffer_len;
    self->callback_for_non_blocking = MP_OBJ_NULL;
    self->io_mode = BLOCKING;
    self->non_blocking_descriptor.copy_in_progress = false;
    memset(self->dma_buffer, 0, SIZEOF_DMA_BUFFER_IN_BYTES);

    if (self->i2s_id == 0) {
        self->spi = SPI2;
        self->dma = DMA1_Channel4;
        self->dma_flags = I2S_DMA_A_FLAGS;
        self->dma_ht_flag = I2S_DMA_A_HT;
        self->dma_irqn = DMA1_Channel4_IRQn;
    } else {
        self->spi = SPI3;
        self->dma = DMA1_Channel5;
        self->dma_flags = I2S_DMA_B_FLAGS;
        self->dma_ht_flag = I2S_DMA_B_HT;
        self->dma_irqn = DMA1_Channel5_IRQn;
    }

    i2s_pin_init(sck, sck_af, false);
    i2s_pin_init(ws, ws_af, false);
    i2s_pin_init(sd, sd_af, mode == RX);

    machine_i2s_active[self->i2s_id] = self;
    i2s_periph_init(self);

    /* Arm the DMA before enabling the peripheral. Enabling first lets the FIFO
     * move a sample during the gap, and the DMA then starts on the second slot
     * of a frame, leaving left and right swapped for the life of the object.
     * That was true of the SAI and there is no reason to find out the hard way
     * whether it is true here too. */
    i2s_dma_init(self);
    I2S_Cmd(self->spi, ENABLE);
}

static machine_i2s_obj_t *mp_machine_i2s_make_new_instance(mp_int_t i2s_id) {
    if (i2s_id < 0 || i2s_id >= MAX_I2S_CH32) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid id"));
    }

    machine_i2s_obj_t *self;
    if (MP_STATE_PORT(machine_i2s_obj[i2s_id]) == NULL) {
        self = mp_obj_malloc(machine_i2s_obj_t, &machine_i2s_type);
        MP_STATE_PORT(machine_i2s_obj[i2s_id]) = self;
        self->i2s_id = i2s_id;
        self->spi = NULL;
    } else {
        self = MP_STATE_PORT(machine_i2s_obj[i2s_id]);
        mp_machine_i2s_deinit(self);
    }
    return self;
}

/* Stop the hardware, without touching the heap.
 *
 * Separated from mp_machine_i2s_deinit() so the soft-reset path can use it:
 * there the ring buffer is about to be reclaimed wholesale and freeing it
 * individually would be pointless, but the DMA absolutely must be stopped
 * first. */
static void i2s_hw_stop(machine_i2s_obj_t *self) {
    NVIC_DisableIRQ(self->dma_irqn);
    DMA_ITConfig(self->dma, DMA_IT_TC | DMA_IT_HT, DISABLE);
    DMA_Cmd(self->dma, DISABLE);
    SPI_I2S_DMACmd(self->spi,
        (self->mode == RX) ? SPI_I2S_DMAReq_Rx : SPI_I2S_DMAReq_Tx, DISABLE);
    I2S_Cmd(self->spi, DISABLE);

